// File: chordTypeMap.js


/**
 * @module chordTypeMap
 *
 * Карта типов аккордов и их интервальных структур.
 *
 * @type {Object.<string, string[]>}
 */
module.exports = {
  // Трезвучия
  '':    ['P1', 'M3', 'P5'],      // мажор
  'm':   ['P1', 'm3', 'P5'],      // минор
  'dim': ['P1', 'm3', 'd5'],      // уменьшенное
  'aug': ['P1', 'M3', 'A5'],      // увеличенное

  // Септаккорды
  '7':     ['P1', 'M3', 'P5', 'm7'],   // доминант-септ
  'maj7':  ['P1', 'M3', 'P5', 'M7'],   // большой мажорный септ
  'm7':    ['P1', 'm3', 'P5', 'm7'],   // минорный септ
  'dim7':  ['P1', 'm3', 'd5', 'd7'],   // уменьшенный септ
  'mMaj7': ['P1', 'm3', 'P5', 'M7'],   // минор-мажорный септ
};
